{
    "intents": [
        {
            "tag": "Director_of_Level(3,4,5)",
            "patterns": [
              "who is the Director of Level 3,4,5 of IPRC KIGALI COMPUS?",
              "what is the phone number of Director of Level 3,4,5 of IPRC KIGALI COMPUS?"
            ],
            "responses": [
              "the Director of Level 3,4,5 of IPRC KIGALI COMPUS is GAHAMA SIBOMANA Francois.",
              "phone number: 0788593952"
            ]
        },
          {
        "tag": "CEO",
        "patterns": [
          "Who is the Principal of IPRC KIGALI COMPUS?"
        ],
        "responses": [
          "The principal of IPRC KIGALI is Diogene MULINDAHABI "
        ]
      },
       {
        "tag": "Deputy_RP_IPRC_Kigali",
        "patterns": [
          "Who is the Deputy Principal in charge of Academics and Training?"
        ],
        "responses": [
          "the Deputy Principal in charge of Academics and Training is Dr. Alice IKUZWE"
        ]
      },
      
      {
        "tag": "Director_of_Career_Development_and_Guidance_Unit",
        "patterns": [
          "Who is the Director of Career Development and Guidance Unit at IPRC KIGALI?"
        ],
        "responses": [
          " the Director of Career Development and Guidance Unit at IPRC KIGALI is MUTAGANIRA Fidèle"
        ]
      },
      {
        "tag": "Director_of_Student_Affairs",
        "patterns": [
          "who is the Director of Student Affairs at IPRC KIGALI?"
        ],
        "responses": [
          "the Director of Student Affairs at IPRC KIGALI is KAJUGA Bernard Thomas."
        ]
      },
      {
        "tag": "Addresss_Location",
        "patterns": [
          "WHere is the IPRC KIGALI COMPUS is located"
        ],
        "responses": [
          "kk 15 Rd, Kigali, Rwanda"
        ]
      },
      {
        "tag": "Route_Address/Map",
        "patterns": [
          "Guide me using google map to IPRC KIGALI COMPUS"
        ],
        "responses": [
          "Your location to  to IPRC KIGALI COMPUS - Google Maps"
        ]
      },
      {
        "tag": "Division Manager in charge of Corporate Services",
        "patterns": [
          "who is the Division Manager in charge of Corporate Services in IPRC KIGALI COMPUS?",
          "What is the phone number of  the Division Manager in charge of Corporate Services in IPRC KIGALI COMPUS?"
        ],
        "responses": [
          "the Division Manager in charge of Corporate Services in IPRC KIGALI COMPUS is Mr Charles GAKOMEYE.",
          "phone number: +250788615809"
        ]
         },


        {
            "tag": "Head_of_ICT_Department ",
            "patterns": [
              "who is the Head of ICT Department?",
              "What is the phone number of Head of ICT Department?" 
            ],
            "responses": [
              "Head of ICT Department is Sabushimike Donatien.",
              " phone number of Head of ICT Department: 0788629214"
            ]
        },
        {
            "tag": "Department",
            "patterns": [
              "what is the faculties that are in IPRC KIGALI COMPUS?",
              " How many the department and give all of those in IPRC KIGALI COMPUS?",
              "show me the faculties which are in IPRC KIGALI COMPUS?"
            ],
            "responses": [
              "Department of ICT",
              "Department of Creative Arts",
              "Department of Civil Engineering",
              "Department of Mechanical Engineering",
              "Department of Mining Engineering",
              "Department of Transport and Logistics",
              "Department of Electrical and Electronics Engineering"
            ]
        },
         { "tag": "links",
           "patterns":[
            "what can get the link of IPRC KIGALI COMPUS for more information about?",
            "where can we get the link?",
            "show me the link for announcement of IPRC KIGALI COMPUS?"
            ],
          "responses":[
          " You can use this link https://www.iprckigali.rp.ac.rw/1/about-us for more information",
          "You can use this link https://www.iprckigali.rp.ac.rw/ for more information"
          ]
         },
        {
            "tag": "Admission Requirements",
            "patterns": [
              "What are the admission requirements for IPRC Kigali?",
              "Do I need to take an entrance exam to get into IPRC Kigali?",
              "What documents do I need to provide for admission to IPRC Kigali?",
              "Is there an age limit for admission to IPRC Kigali?",
              "What is the deadline for submitting admission materials to IPRC Kigali?"
            ],
            "responses": [
              "Admission to IPRC Kigali requires a high school diploma and passing an entrance exam.",
              "You will need to provide a copy of your high school transcript and ID.",
              "There is no age limit for admission to IPRC Kigali.",
              "The deadline for submitting admission materials varies, please contact the school for more information."
            ]
        },
        {
            "tag": "Available Courses",
            "patterns": [
              "What courses are available at IPRC Kigali?",
              "Do you offer any online courses at IPRC Kigali?",
              "Can you provide information about the course curriculum for IPRC Kigali?",
              "What is the duration of the courses offered at IPRC Kigali?",
              "Is there any flexibility in the course schedule at IPRC Kigali?"
            ],
            "responses": [
              "IPRC Kigali offers courses in ICT, Creative Arts, and Civil Engineering.",
              "Yes, IPRC Kigali offers online courses for some programs.",
              "Please contact the school for more information about"
              ]
             },

               {
              "tag": "Admission_Requirements",
              "patterns": [
              "What are the admission requirements for IPRC KIGALI COMPUS?",
              "What documents do I need to apply to IPRC KIGALI COMPUS?",
              "Can you tell me the admission process for IPRC KIGALI COMPUS?"
               ],
              "responses": [
              "To apply to IPRC KIGALI COMPUS, you will need to provide a copy of your high school diploma, national ID, and a recent passport-sized photo.",
              "You will also need to complete an application form and pay the admission fee.",
              "You may also be required to take an entrance exam or attend an interview."
               ]
               },

               {
                "tag": "Courses_Offered",
                "patterns": [
                "What courses are offered at IPRC KIGALI COMPUS?",
                "Can you list the programs available at IPRC KIGALI COMPUS?",
                "What degrees can I earn at IPRC KIGALI COMPUS?"
                 ],
                   "responses": [
                   "IPRC KIGALI COMPUS offers programs in ICT, Creative Arts, and Civil Engineering.",
                   "You can earn a certificate, diploma, or a higher diploma in your chosen field.",
                   "Please visit the IPRC KIGALI COMPUS website for a complete list of courses and programs."
                    ]
                     },

                     {
                     "tag": "Fee_Structure",
                      "patterns": [
                      "What is the fee structure for IPRC KIGALI COMPUS?",
                      "How much does it cost to study at IPRC KIGALI COMPUS?",
                     "Are there any scholarships available at IPRC KIGALI COMPUS?"
                     ],
                  "responses": [
                  "The fee structure at IPRC KIGALI COMPUS varies depending on the course and program you choose.",
                  "You can contact the college for a complete fee structure and information on scholarships.",
                  "IPRC KIGALI COMPUS does offer scholarships and financial aid to eligible students."
                  ]
                  },

                 {
                   "tag": "Faculty_Members",
                  "patterns": [
                  "Who are the faculty members at IPRC KIGALI COMPUS?",
                  "Can you give me a list of the teachers at IPRC KIGALI COMPUS?",
                  "How can I contact a faculty member at IPRC KIGALI COMPUS?"
                    ],
                    "responses": [
                    "The faculty members at IPRC KIGALI COMPUS are highly qualified and experienced professionals in their fields.",
                    "You can find a list of faculty members on the IPRC KIGALI COMPUS website.",
                    "You can contact a faculty member through the college's directory or by emailing the college directly."
                    ]
                     }

                      ]

                      }
